# GetCreatedElementIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentDifference..::..GetCreatedElementIds Method
DocumentDifference Class See Also
---
Created element id collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ISet<ElementId> GetCreatedElementIds()
```

Visual Basic
---
```text
Public Function GetCreatedElementIds As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetCreatedElementIds()
```

# See Also
DocumentDifference Class
Autodesk.Revit.DB Namespace